Repository: Sergio0694/Brainf_ckSharp
Catalog: Brainf_ck-sharp.UWP/MultilingualResources/Brainf_ck-sharp.UWP.*.xlf
Languages: it

# CodeNotFoundBody
source: The requested code is not present in the roaming database, try again later
it: Il codice richiesto non è presente nel database condiviso, riprova più tardi

# CodeNotFoundTitle
source: Code not found
it: Codice non trovato

# TimelineSupportTitle.Text
source: Log activities in the Timeline
it: Registra attività nella Timeline

# AlreadyLoadedBody
source: The requested code is already loaded in the IDE
it: Il codice richiesto è lo stesso già presente nell'IDE

# AlreadyLoadedTitle
source: Already loaded
it: Codice già caricato

# ErrorRun.Text
source: Error
it: Errore

# MoreStackFrames
source: stack frames
it: stack frame

source: Shared from Brainf*ck#
it: Condiviso da Brainf*ck#

# UnsavedChangesClear
source: There are unsaved changes in the IDE, and clearing the screen now will cause those changes to be lost. Are you sure you want to continue? If you want to cancel, just close this popup.
it: Ci sono modifiche non salvate nell'IDE, che verranno perse pulendo lo schermo ora. Sei sicuro di voler continuare? Se vuoi annullare, chiudi semplicemente questo popup.

# UnsavedChangesLoading
source: There are unsaved changes in the IDE, and loading a saved code now will cause those changes to be lost. Are you sure you want to continue? If you want to cancel, just close this popup.
it: Ci sono modifiche non salvate nell'IDE, che verranno perse caricando un nuovo codice sorgente ora. Sei sicuro di voler continuare? Se vuoi annullare, chiudi semplicemente questo popup.

# UnsavedChangesTitle
source: Unsaved changes
it: Modifiche non salvate

# ProtectUnsavedChanges.Text
source: Protect unsaved changes
it: Proteggi modifiche non salvate

# AutorunCodeInBackground.Text
source: Autorun code in the background
it: Controlla il codice in background

source: No code interpreted
it: Nessun operatore presente

# KeyboardShortcutsDescription
source: Be more productive and save time
it: Diventa più produttivo e risparmia tempo

# UserGuideKeyboardShortcuts
source: Keyboard shortcuts
it: Scorciatoie da tastiera

# GuideShortcutsDebug1.Description
source: Continues the execution in debug mode
it: Continua l'esecuzione in modalità debug

# GuideShortcutsDebug2.Description
source: Continues and ingores following breakpoints
it: Continua ed ignora breakpoint successivi

# GuideShortcutsDebugIntroduction.Text
source: The debug mode offers some additional shortcuts:
it: La modalità debug offre alcune scorciatoie aggiuntive:

# GuideShortcutsIntroduction.Text
source: Some of the most common operations in the app also have a keyboard shortcut that can be used to access them more quickly. Here is the complete list:
it: Alcune delle operazioni più comuni nell'app dispongono anche di una scorciatoia da tastiera che può essere usata per velocizzarne l'utilizzo. Ecco la lista completa:

# GuideShortcutsItem1.Description
source: Executes the current script
it: Esegue lo script visualizzato

# GuideShortcutsItem2.Description
source: When in the IDE, executes the code in debug mode, if possible
it: Nell'IDE, esegue il codice in modalità debug, se possibile

# GuideShortcutsItem3.Description
source: Saves the current script in the IDE
it: Salva lo script presente nell'IDE

# GuideShortcutsItem4.Description
source: Saves the script with a (different) name
it: Salva lo script con un nome (diverso)

# GuideShortcutsItem5.Description
source: Shows the Unicode characters map
it: Mostra la mappa dei caratteri Unicode

# GuideShortcutsItem6.Description
source: When in the console, shows the memory state
it: Nella console, mostra lo stato della memoria

# GuideShortcutsItem7.Description
source: When in the IDE, opens the saved codes library
it: Nell'IDE, apre la libreria dei codici salvati

# GuideShortcutsItem8.Description
source: Shows the app settings
it: Mostra le impostazioni dell'app

# CopyButton.ToolTipService.ToolTip
source: Copy
it: Copia

# CutButton.ToolTipService.ToolTip
source: Cut
it: Taglia

# PasteButton.ToolTipService.ToolTip
source: Paste
it: Incolla

# SnippetDuplicateValue
source: Duplicate value
it: Duplica valore

# SnippetInlineLoop
source: Inline loop
it: Loop inline

# SnippetResetCell
source: Reset cell
it: Resetta cella
