Repository: Sergio0694/Brainf_ckSharp
Catalog: Brainf_ck-sharp.UWP/MultilingualResources/Brainf_ck-sharp.UWP.*.xlf
Languages: it

# RowTitleRun.Text
source: Row
it: Ri

# ShortCharacter
source: Char
it: Car

# ExEmptyStdin
source: Stdin buffer exhausted
it: Buffer Stdin esaurito

# ExLowerBound
source: Lower bound exceeded
it: Limite inferiore superato

# ExMaxStdout
source: Stdout buffer length limit exceeded
it: Limite lunghezza buffer Stdout superato

# ExMaxValue
source: Max value exceeded
it: Valore massimo superato

# ExNegativeValue
source: Negative value
it: Valore negativo

# ExUpperBound
source: Upper bound exceeded
it: Limite superiore superato

source: Interpreter error
it: Errore interprete

# ThresholdExceeded
source: Time threshold exceeded
it: Limite di tempo superato

# WrongBrackets
source: Mismatched parentheses
it: Parentesi non corrispondenti

source: run
it: esegui

# RestartRun.Text
source: RESTART
it: RIAVVIO

# Exception
source: thrown
it: eccezione

# InternalError
source: error
it: errore

source: syntax error
it: errore sintassi

# Threshold
source: runtime error
it: errore runtime

# Clear.Label
source: Clear
it: Cancella comando

# MemoryState.Label
source: Memory state
it: Stato memoria

# PlayButton.Label
source: Play
it: Esegui

# Undo.Label
source: Undo
it: Annulla

# Restart.Label
source: Restart
it: Riavvia

# Clrscr.Label
source: Clear screen
it: Pulisci lo schermo

# MemoryStateTitle
source: Memory state
it: Stato memoria

# Unicode.Label
source: Show Unicode characters
it: Mostra caratteri Unicode

# UnicodeTitle
source: Unicode characters
it: Caratteri Unicode

source: Ready
it: Pronto

source: Warning
it: Attenzione

source: Position
it: Posizione

source: Breakpoint reached
it: Punto di interruzione raggiunto

source: Error location
it: Posizione errore

source: Error type
it: Tipo errore

source: Source code
it: Codice sorgente

# Stats
source: Statistics
it: Statistiche

source: memory cells
it: celle di memoria

# LowercaseAtPosition
source: at position
it: in posizione

# LowercaseOperators
source: operators
it: operatori

# LowercaseSingleOperator
source: 1 operator
it: 1 operatore

# RepeatScript.Label
source: Repeat last script
it: Ripeti ultimo script

# ContinueButton.Title
source: Continue
it: Continua

# SkipButton.Title
source: Skip
it: Salta

source: Favorites
it: Preferiti

source: Personal codes
it: Codici personali

source: Sample codes
it: Codici di esempio

# MoreCodes
source: source codes
it: codici sorgente

# OneCode
source: 1 source code
it: 1 codice sorgente

source: Code library
it: Libreria codici

# CodeLibraryButton.Label
source: Browse code library
it: Sfoglia libreria codici

# RunTitle
source: Run
it: Esegui

# SaveAsButton.Label
source: Save as
it: Salva con nome

# SaveButton.Label
source: Save
it: Salva

# FilenameBlock.Text
source: File name:
it: Nome file:

# CodePreviewBlock.Text
source: Code preview:
it: Anteprima codice:

# CodeTitleBox.PlaceholderText
source: Enter the code title
it: Inserisci un titolo

source: Already used
it: Nome già in uso

source: Available
it: Disponibile

source: Empty
it: Nome non valido

# Clipboard
source: Copy to clipboard
it: Copia negli appunti

source: Delete
it: Elimina

# Email
source: Send via email
it: Invia per email

source: Favorite
it: Aggiungi ai preferiti

source: OS share
it: Condivisione OS

source: Rename
it: Rinomina

source: Save file
it: Salva file

source: Share
it: Condividi

source: Unfavorite
it: Rimuovi dai preferiti

source: Plain text
it: Testo semplice

# SharedCode
source: Brainf*ck shared code
it: Codice condiviso Brainf*ck#

source: Share error
it: Errore condivisione

# ShareErrorBody
source: There was an error while sharing the code, try again later
it: C'è stato un errore durante la condivisione del codice, riprova più tardi

source: Share completed
it: Condivisione completata

# ShareCompletedBody
source: The selected source code has been shared correctly
it: Il codice selezionato è stato condiviso correttamente

source: Rename code
it: Rinomina codice

source: Save code
it: Salva codice

source: Code saved
it: Codice salvato

# CodeSavedBody
source: The new source code has been saved correctly
it: Il nuovo codice sorgente è stato salvato correttamente

# RedoButton.Label
source: Redo
it: Ripeti

# NewLineButton.Label
source: New line
it: Nuova riga

source: About
it: Informazioni

# AboutButton.Label
source: About
it: Informazioni

# RateStoreBlock.Text
source: Rate in the Store
it: Vota nello Store

# ContactsBlock.Text
source: Contacts
it: Contatti

# DevelopedByPart2Run.Text
source: Thanks to Andrea Salvati for his help with the original interpreter algorithm, Camil Demetrescu for the idea to port Brainf*ck# to Windows 10 and Christopher Blackman for his help during the app development.
it: Grazie ad Andrea Salvati per il suo aiuto con l'algoritmo originale dell'interprete di Brainf*ck, Camil Demetrescu per l'idea di portare Brainf*ck# su Windows 10 e Christopher Blackman per il suo aiuto durante lo sviluppo dell'app.

# DevelopedByRun.Text
source: Developed by
it: Sviluppata da

source: Something bad happened
it: È successo qualcosa

source: Store connection error
it: Errore di connessione

# StoreConnectionErrorBody
source: The Store generated a connection error when trying to process the purchase, try again
it: Lo Store ha avuto un problema di connessione durante l'acquisto, prova di nuovo

# DonationCompletedBody
source: Thank you so much for supporting Brainf*ck#!
it: Grazie di cuore per il tuo supporto a Brainf*ck#!

source: Purchase canceled
it: Donazione annullata

# PurchaseCanceledBody
source: The in-app purchase has not been completed
it: L'acquisto in-app non è stato completato

# BreakpointNotAllowedBlock.Text
source: Can't place a breakpoint here
it: Impossibile inserire un punto di interruzione qui

source: Remove all
it: Rimuovi tutti

# FirstControlUnicodeGroup.Value
source: 0 to 31
it: Da 0 a 31

# FirstControlUnicodeGroup.Description
source: Control characters
it: Caratteri di controllo

# SecondControlUnicodeGroup.Value
source: 128 to 159
it: Da 128 a 159

# SecondControlUnicodeGroup.Description
source: Not visible
it: Non visibili

# CSource
source: C source code
it: Codice sorgente C

# ExportToC
source: Export C code
it: Esporta codice C

source: Export completed
it: Esportazione completata

# ExportCompletedBody
source: The selected code has been saved successfully as a C source file
it: Il codice selezionato è stato salvato correttamente come un file sorgente C

source: Not modified
it: Non modificato

source: Changelog
it: Novità

# QuickMemoryViewerButton.ToolTipService.ToolTip
source: Quick memory view
it: Vista rapida memoria

# VirtualKeyboardButton.ToolTipService.ToolTip
source: Brainf*ck# operators keyboard
it: Tastiera operatori Brainf*ck#

# DeleteButton.Label
source: Delete
it: Cancella

# OverflowSwitchButton.ToolTipService.ToolTip
source: Toggle overflow mode
it: Cambia modalità overflow

source: Overflow mode
it: Modalità overflow

# OverflowModeBody
source: You have enabled the byte overflow mode. This means that the maximum value of each memory cell will now be 255 and that increasing a cell over that value (or decreasing a cell that has a value equal to 0) will cause it to overflow, ie. if it's increased from 255 it will be set to 0, and if it's decreased from 0 it will reach 255.
it: Hai attivato la modalità byte overflow. Questo significa che il massimo valore di ogni cella di memoria sarà 255 e che incrementare una cella oltre quel valore (o decrementarla quando si trova già a 0) comporterà un overflow, cioè se a una cella viene aggiunto 1 da 255 verrà settata a 0, e se viene sottratto 1 da 0 raggiungerà il valore massimo di 255.

# ThankYouBlock1.Text
source: Thank you for downloading
it: Grazie per aver scaricato

# ThankYouBlock2.Text
source: Are you enjoying it so far?
it: Come ti sei trovato fino ad ora?

# ConfirmBlock.Text
source: Confirm
it: Conferma

source: A real ninjacat!
it: Un vero ninjacat!

# ARealNinjacatBody
source: It's great to know you're having fun with the app so far! Would you like to post a review in the Store to support the developer?
it: È fantastico sapere che ti stai divertendo con l'app! Vorresti pubblicare una recensione nello Store per mostrare il tuo supporto allo sviluppatore?

source: How's it going?
it: Come sta andando?

# SendMail
source: Send email
it: Invia email

# SorryBody
source: Would you like to contact the developer and send your feedback and let him know if you're having any problems in particular? This way he'll be able to help you!
it: Vorresti contattare lo sviluppatore e mandare il tuo feedback per fargli sapere se stai avendo dei problemi in particolare con l'app? In questo modo sarà più facile aiutarti e potrai contribuire a rendere l'app ancora migliore!

# SorryTitle
source: Sorry about that
it: Profondo dispiacere

source: Sure!
it: Certo!

source: Settings
it: Impostazioni

# SettingsButton.Label
source: Settings
it: Impostazioni

# AutoIndentTitle.Text
source: Auto indent brackets
it: Indenta automaticamente parentesi

# BracketsStyleTitle.Text
source: Brackets style
it: Formattazione parentesi

source: New line
it: A capo

source: Same line
it: Stessa riga

# TabLength.Text
source: Tab length
it: Lunghezza tabulazione

# ThemesUnlocked
source: Themes pack unlocked
it: Pacchetto temi sbloccato

# TapToUnlock.Text
source: Tap to unlock
it: Tocca per sbloccare

# CommentRun.Text
source: Move to next cell
it: Avanza a cella successiva

# CommentRun2.Text
source: Print value
it: Stampa valore

source: Default
it: Predefinito

# AutosaveTitle.Text
source: Autosave loaded documents
it: Salvataggio automatico

# FontTypeTitle.Text
source: Font type
it: Tipo carattere

# IDETheme.Text
source: Theme
it: Tema

# ShowStatusBarTitle.Text
source: Show status bar
it: Mostra status bar

# LowercaseAvailableSettings
source: available settings
it: impostazioni disponibili

source: themes pack locked
it: pacchetto temi bloccato

# RenderWhitespacesTitle.Text
source: Render whitespaces
it: Mostra spazi e tabulazioni

# ClearStdinBuffer.Text
source: Clear Stdin buffer on execution
it: Pulisci buffer Stdin dopo esecuzione

source: Interpreter
it: Interprete

# ExDuplicateFunctionDefinition
source: Duplicate function definition
it: Definizione funzione duplicata

# ExFunctionsLimitExceeded
source: Functions limit exceeded
it: Limite funzioni superato

# ExStackLimitExceeded
source: Stack overflow exception
it: Stack overflow

# ExUndefinedFunction
source: Undefined function call
it: Funzione non definita

# ShowPBrainButtons.Text
source: Show PBrain keyboard buttons
it: Mostra pulsanti virtuali PBrain

# FunctionDefinitionsTitle
source: Function definitions
it: Funzioni definite

source: defined function
it: funzione definita

source: defined functions
it: funzioni definite

source: Current state
it: Stato console

# GuideIntroduction1.Text
source: Brainf*ck is an esoteric programming language invented in 1993 by Urban Müller.
it: Brainf*ck è un linguaggio di programmazione esoterico inventato nel 1993 da Urban Müller.

# GuideIntroduction2.Text
source: The language replicates a Turing machine, as the state of the interpreter is only described of a memory array and a memory pointer than can move back and forth and change values of the memory cells, as it passes over them.
it: Il linguaggio replica il funzionamento di una macchina di Turing, poiché lo stato dell'interprete è descritto solo da un vettore di memoria e da un puntatore che può spostarsi in due direzioni e modificare il valore delle celle di memoria, quando vi passa sopra.

# GuideIntroduction3.Text
source: A Brainf*ck program is made up of only 8 operators:
it: Un programma in Brainf*ck è composto di soli 8 operatori:

# GuideOperator1.Description
source: Moves the memory pointer to the next cell
it: Sposta il puntatore della memoria alla cella successiva

# GuideOperator2.Description
source: Moves the memory pointer back
it: Sposta il puntatore della memoria indietro

# GuideOperator3.Description
source: Increments the value of the current cell
it: Incrementa il valore della cella attuale

# GuideOperator4.Description
source: Decrements the value of the current cell
it: Decrementa il valore della cella attuale

# GuideOperator5.Description
source: Starts a loop on the current cell, only if its value is greater than 0
it: Inizia un ciclo dalla cella attuale, solo se il suo valore è maggiore di 0

# GuideOperator6.Description
source: Loops and executes the current operators sequence if the value of the current cell is greater than 0
it: Ripete il ciclo ed esegue la sequenza di operatori attuale se il valore della cella corrente è maggiore di 0

# GuideOperators7Part1.Text
source: Prints the Unicode character corresponding to the value of the current memory cell. The Unicode table is available in the app, under the
it: Stampa il carattere Unicode corrispondente al valore della cella di memoria attuale. La tavola Unicode è disponibile nell'app, dal menu

# GuidePBrain.Text
source: PBrain is an extension of the Brainf*ck language, created by Paul M. Parks. It adds support for functions, with the addition of the following operators:
it: PBrain è un'estensione del linguaggio Brainf*ck, creata da Paul M. Parks, che aggiunge il supporto alle funzioni tramite l'introduzione dei seguenti nuovi operatori:

# GuidePBrainOperator1.Description
source: Defines a function and binds it to the value of the current memory cell
it: Definisce una funzione a cui viene assegnato il valore della cella di memoria attuale

# GuidePBrainOperator2.Description
source: Ends the current function definition
it: Termina la definizione della funzione in corso

# GuidePBrainOperator3.Description
source: Calls the function associated with the value of the current memory cell
it: Chiama la funzione associata al valore della cella di memoria attuale

# GuidePBrainWarning.Text
source: A function definition must contain at least a Brainf*ck operator and its body can't be empty. Moreover, it is not possible to define nested functions.
it: Una definizione di funzione deve contenere almeno un operatore Brainf*ck e il suo corpo non può essere vuoto. Inoltre, non è possibile definire funzioni annidate.

# GuideSamplePrintHelloComment1.Text
source: 7 in cell #0
it: 7 nella cella #0

# GuideSamplePrintHelloComment2.Text
source: 7 * 5 = 35 in cell #1
it: 7 * 5 = 35 nella cella #1

# GuideSamplePrintHelloComment3.Text
source: 35 * 2 in cell #2 and 35 * 3 in #3
it: 35 * 2 nella cella #2 e 35 * 3 nella #3

# GuideSamplePrintHelloComment4.Text
source: Back to loop start and decrement
it: Indietro all'inizio del loop e decremento

# GuideSamplePrintHelloComment5.Text
source: Adjust the values and print
it: Prepare e stampa i valori corretti

# GuideSamplePrintHelloTitle.Text
source: Print "Hello"
it: Stampa "Hello"

# GuideSampleResetComment.Text
source: Subtract 1 each time
it: Sottrai 1 ad ogni iterazione

# GuideSampleResetTitle.Text
source: Reset the current cell
it: Resetta la cella attuale

# GuideSamples1.Text
source: A good strategy to learn how to code in Brainf*ck, as with everything else, is to start from simpler and smaller programs and to make them more complex along the way.
it: Una buona strategia per imparare a programmare in Brainf*ck, come in tutte le altre cose, consiste nell'iniziare da programmi più piccoli e semplici per poi renderli man mano più complessi col tempo.

# GuideSamples2.Text
source: For example, a common operation is to reset the value of the current cell, whatever it may be.
it: Per esempio, un'operazione comune consiste nel resettare la cella attuale, a prescindere da quale fosse il suo valore.

# GuideSamples3.Text
source: A simple loop can be used in this case:
it: In questo caso può essere utilizzato un semplice ciclo:

# GuideSamples4.Text
source: In many situations it is useful to make a copy of the current cell, to be able to perform some operations with its value, without losing track of the initial state of the memory cell.
it: In molte situazioni è utile salvare una copia della cella attuale, per poter effettuare operazioni con il suo valore senza perdere il riferimento dello stato originario della cella di memoria.

# GuideSamples5.Text
source: To achieve this, it is possible to create two copies of the current value, resetting the current cell, and then move the second copy back to the first cell, to end up with the original value plus a copy in the following cell:
it: A questo fine, è possibile creare due copie separate del valore attuale, resettando la cella attuale, e successivamente spostare la seconda copia indietro nella posizione della cella iniziale, per ottenere il valore originario e una copia nella cella successiva:

# GuideSamples6.Text
source: All these techniques can be combined to write more complex programs. A good idea is to try to optimize the script in order to perform as few operations as possible — generally this also means that the final code will be shorter and easier to read.
it: Tutte queste tecniche possono essere combinate per scrivere programmi più complessi. È una buona idea cercare di ottimizzare gli script al fine di effettuare meno operazioni possibile — questo generalmente significa anche che il codice finale sarà più corto e più facile da comprendere.

# GuideSamples7.Text
source: In this example, to print the word "Hello" two loops will be used to set two cells to values closer to the letters that will be printed. It's definitely better to use a similar approach than to repeating the + operator 72 times to print the "H" character:
it: In questo esempio, per stampare la parola "Hello" saranno utilizzati due cicli per settare due celle di memoria a valori prossimi a quelli dei caratteri da stampare. È decisamente meglio un approccio simile rispetto a ripetere l'operatore + 72 volte solo per stampare il carattere "H":

# GuideSamples8.Text
source: This script will set the cells #2 and #3 to values closer to the characters that will be printed by the program, so that less operations will be needed to get to the actual values the code wants to display to the user.
it: Questo script setta le celle #2 e #3 ai valori più vicini a quelli dei caratteri che saranno stampati dal programma, in modo che siano necessarie meno operazioni per raggiungere i valori che verranno effettivamente mostrati all'utente.

# GuideSampleSimpleLoopComment1.Text
source: Copy in the cells #1 and #2
it: Copia nelle celle #1 e #2

# GuideSampleSimpleLoopComment2.Text
source: Decrement the first cell
it: Decrementa la prima cella

# GuideSampleSimpleLoopComment3.Text
source: Move second copy back to cell #0
it: Sposta la seconda copia indietro nella cella #0

# GuideSampleSimpleLoopTitle.Text
source: Copy the current value
it: Copia valore attuale

# ChangelogButton.Title
source: Changelog
it: Note di versione

# SendFeedbackButton.Title
source: Send feedback
it: Invia feedback

# UserGuideButton.Title
source: User guide
it: Guida

# GuidesInfoBlock.Text
source: Guides and info
it: Guida e info

# GuideOperator8.Description
source: Reads a Unicode character from the Stdin buffer and stores its value in the current memory cell
it: Legge un carattere Unicode dal buffer Stdin e salva il suo valore nella cella di memoria attuale

# GuideCodeSamplesDescription
source: Some code samples to learn from
it: Alcuni esempi da cui imparare

# GuideIntroductionDescription
source: Get to know the language
it: Conosci il linguaggio

# GuidePBrainDescription
source: Make the language more powerful
it: Rendi il linguaggio più completo

# UserGuide
source: Brainf*ck# guide
it: Guida di Brainf*ck#

# PBrainInfoLink.Text
source: What's this?
it: Che cos'è?

# UserGuideCodeSamples
source: Code samples
it: Esempi di codice

# UserGuideIntroduction
source: Introduction
it: Introduzione

# UserGuidePBrainExtensions
source: PBrain extensions
it: Estensione PBrain

# WelcomeTitle
source: Welcome to Brainf*ck#!
it: Benvenuto in Brainf*ck#!

# WelcomePart1.Text
source: Thank you for downloading the app, I hope you'll enjoy using it!
it: Grazie di aver scaricato quest'app!

# WelcomePart2.Text
source: Please feel free to send me an email if you have suggestions or feedback, or if you found a bug, and I'll be happy to help.
it: Puoi mandarmi un messaggio email in qualsiasi momento se hai suggerimenti o feedback, o se hai trovato un bug, e sarò felice di aiutare.

# WelcomePart4.Text
source: Before jumping straight into the app, it might be a good idea to read the user guide to make sure you remember all there is to know about the language!
it: Prima di passare subito all'azione, è una buona idea leggere la guida dell'app per essere sicuri di ricordarsi tutto ciò che c'è da sapere sul linguaggio!

# MoveButton.Label
source: Move
it: Sposta cursore

source: Sum
it: Somma

source: Unicode sum
it: Somma Unicode

source: Unicode value
it: Valore Unicode

source: Header comments
it: Header commentato

# DebuggingDescription
source: Find bugs in your code more easily
it: Trova errori più facilmente

# GuideDebuggingComment1
source: Stop before the first loop operator
it: Stop al primo operatore nel loop

# GuideBreakpointTitle.Text
source: Break inside a loop
it: Break all'interno di un loop

# GuideDebugging1.Text
source: Do you wonder what's the point of that additional gray bar on the left? You can tap it to add a breakpoint at the corresponding line in your code. This makes it easier to work on larger scripts, as a breakpoint will cause the execution to halt and will let you inspect the current memory state at that location.
it: Ti sei chiesto a cosa serva quella barra grigia a sinistra? Puoi farci click sopra per aggiungere un breakpoint alla linea di codice corrispondente. Questo rende più facile lavorare su script di grandi dimensioni, perché un breakpoint fermerà l'esecuzione del codice e ti permetterà di controllare lo stato della memoria in quella posizione.

# GuideDebugging2.Text
source: Here's a simple example:
it: Ecco un semplice esempio:

# GuideDebugging3.Text
source: When you execute a script in debugging mode and hit a breakpoint, the app will show two options to control how to execute the rest of the script:
it: Quando esegui uno script in modalità debug e viene raggiunto un breakpoint, l'app mostrerà due opzioni per controllare come eseguire il resto dello script:

# GuideDebugging4.Text
source: Keep in mind that the script execution is only halted when the control flow manages to reach a breakpoint, so it's possible to see code with even multiple breakpoints being run straight to the end. This can indicate that one or more loop conditions are not met, so part of the script is effectively being skipped.
it: Ricorda che l'esecuzione di uno script viene interrotta solo se il flusso di controllo raggiunge un breakpoint, quindi è possibile che codice con anche più di un breakpoint venga eseguito direttamente fino alla fine. Questo può indicare che una o più condizioni di loop non sono verificate, e che parte dello script è stata saltata.

# GuideDebuggingContinueDescription.Text
source: Continue the execution in debugging mode
it: Riprende l'esecuzione in modalità debug

# GuideDebuggingSkipDescription.Text
source: Run the rest of the script without breakpoints
it: Esegue il resto dello script senza breakpoint

# GuideDebugging5.Text
source: As it turns out, breakpoints can help identify bugs even when they're not reached at all.
it: In altre parole, usare breakpoint può aiutare a trovare bug anche quando questi non vengono neanche raggiunti.

# PurchaseErrorBody
source: Something went wrong while trying to complete the purchase, try again later
it: C'è stato un problema che ha impedito di completare l'acquisto, riprova più tardi
